{
    "birds":[
        {
            "id": 1,
            "class": "cards",
            "classConten": "cards-content",
            "classText": "cards-text",
            "cardId": "hbird",
            "title": "Ruby-throated Hummingbird",
            "img": "../Assets/birds/Ruby-throated_Hummingbird.jpg",
            "Kingdom": "Animalia",
            "Phylum": "Chordata",
            "Class": "Aves",
            "Clade": "Strisores",
            "Order": "Apodiformes",
            "Family": "Trochilidae",
            "Genus": "Archilochus",
            "Species": "A. colubris",
            "pOne": "The ruby-throated hummingbird (Archilochus colubris) is a species of hummingbird that generally spends the winter in Central America, Mexico, and Florida, and migrates to Canada and other parts of Eastern North America for the summer to breed. It is by far the most common hummingbird seen east of the Mississippi River in North America.",
            "pTwo": "The species is sexually dimorphic. The adult male has a gorget (throat patch) of iridescent ruby red bordered narrowly with velvety black on the upper margin and a forked black tail with a faint violet sheen. The red iridescence is highly directional and appears dull black from many angles. The female has a notched tail with outer feathers banded in green, black, and white and a white throat that may be plain or lightly marked with dusky streaks or stipples. Males are smaller than females and have slightly shorter bills. Juvenile males resemble adult females, though usually with heavier throat markings. The plumage is molted once a year on the wintering grounds, beginning in early fall and ending by late winter."
        },
        {
            "id": 2,
            "class": "cards",
            "classConten": "cards-content",
            "classText": "cards-text",
            "cardId": "sparrow",
            "title": "House sparrow",
            "img": "../Assets/birds/House sparrow.jpg",
            "Kingdom": "Animalia",
            "Phylum": "Chordata",
            "Class": "Aves",
            "Clade": "Strisores",
            "Order": "Passeriformes",
            "Family": "Passeridae",
            "Genus": "Passer",
            "Species": "P. domesticus",
            "pOne": "The house sparrow (Passer domesticus) is a bird of the sparrow family Passeridae, found in most parts of the world. It is a small bird that has a typical length of 16 cm (6.3 in) and a mass of 24–39.5 g (0.85–1.39 oz). Females and young birds are coloured pale brown and grey, and males have brighter black, white, and brown markings. One of about 25 species in the genus Passer, the house sparrow is native to most of Europe, the Mediterranean Basin, and a large part of Asia. Its intentional or accidental introductions to many regions, including parts of Australasia, Africa, and the Americas, make it the most widely distributed wild bird.",
            "pTwo": "In mass, the house sparrow ranges from 24 to 39.5 g (0.85 to 1.39 oz). Females usually are slightly smaller than males. The median mass on the European continent for both sexes is about 30 g (1.1 oz), and in more southerly subspecies is around 26 g (0.92 oz). Younger birds are smaller, males are larger during the winter, and females are larger during the breeding season. Birds at higher latitudes, colder climates, and sometimes higher altitudes are larger (under Bergmann's rule), both between and within subspecies."
        },
        {
            "id": 3,
            "class": "cards",
            "classConten": "cards-content",
            "classText": "cards-text",
            "cardId": "roadrunner",
            "title": "Greater roadrunner",
            "img": "../Assets/birds/The_Greater_Roadrunner.jpg",
            "Kingdom": "Animalia",
            "Phylum": "Chordata",
            "Class": "Aves",
            "Clade": "Strisores",
            "Order": "Cuculiformes",
            "Family": "Cuculidae",
            "Genus": "Geococcyx",
            "Species": "G. californianus",
            "pOne": "The greater roadrunner (Geococcyx californianus) is a long-legged bird in the cuckoo family, Cuculidae, from the Aridoamerica region in the Southwestern United States and Mexico. The scientific name means 'Californian earth-cuckoo'. Along with the lesser roadrunner, it is one of two species in the genus Geococcyx. This roadrunner is also known as the chaparral cock, ground cuckoo, and snake killer.",
            "pTwo": "The roadrunner is about 52–62 cm (20–24 in) long, has a 43–61 cm (17–24 in) wingspan and weighs 221–538 g (7.8–19.0 oz). It stands around 25–30 cm (9+3⁄4–11+3⁄4 in) tall and is the largest cuckoo of the Americas. The upper body is mostly brown with black streaks and sometimes pink spots. The neck and upper breast are white or pale brown with dark brown streaks, and the belly is white. A crest of brown feathers sticks up on the head, and a bare patch of orange and blue skin lies behind each eye; the blue is replaced by white in adult males (except the blue adjacent to the eye), and the orange (to the rear) is often hidden by feathers. Males and females have identical plumage. Females are slightly smaller, on average 2 cm (3⁄4 in) shorter and 30 g (1.1 oz) lighter than males. The long stout beak is grayish brown to gray and has a hooked tip. Roadrunners have four toes on each zygodactyl foot; two face forward, and two face backward. The toes are brown in color and have pale gold spots."
        },
        {
            "id": 4,
            "class": "cards",
            "classConten": "cards-content",
            "classText": "cards-text",
            "cardId": "vulture",
            "title": "Turkey vulture",
            "img": "../Assets/birds/Turkey_Vulture.jpg",
            "Kingdom": "Animalia",
            "Phylum": "Chordata",
            "Class": "Aves",
            "Clade": "Strisores",
            "Order": "Accipitriformes",
            "Family": "Cathartidae",
            "Genus": "Cathartes",
            "Species": "PC. aura",
            "pOne": "The turkey vulture (Cathartes aura) is the most widespread of the New World vultures. One of three species in the genus Cathartes of the family Cathartidae, the turkey vulture ranges from southern Canada to the southernmost tip of South America. It inhabits a variety of open and semi-open areas, including subtropical forests, shrublands, pastures, and deserts.",
            "pTwo": "A large bird, it has a wingspan of 160–183 cm (63–72 in), a length of 62–81 cm (24–32 in), and weight of 0.8 to 2.41 kg (1.8 to 5.3 lb). Birds in the northern limit of the species' range average larger in size than the vulture from the neotropics. 124 birds from Florida averaged 2 kg (4.4 lb) while 65 and 130 birds from Venezuela were found to average 1.22 and 1.45 kg (2.7 and 3.2 lb), respectively. It displays minimal sexual dimorphism; sexes are identical in plumage and in coloration, and are similar in size. The body feathers are mostly brownish-black, but the flight feathers on the wings appear to be silvery-gray beneath, contrasting with the darker wing linings. The adult's head is small in proportion to its body and is red in color with few to no feathers. It also has a relatively short, hooked, ivory-colored beak. The irises of the eyes are gray-brown; legs and feet are pink-skinned, although typically stained white. The eye has a single incomplete row of eyelashes on the upper lid and two rows on the lower lid."
        },
        {
            "id": 5,
            "class": "cards",
            "classConten": "cards-content",
            "classText": "cards-text",
            "cardId": "albatross",
            "title": "Laysan albatross",
            "img": "../Assets/birds/Laysan_Albatross.jpg",
            "Kingdom": "Animalia",
            "Phylum": "Chordata",
            "Class": "Aves",
            "Clade": "Strisores",
            "Order": "Procellariiformes",
            "Family": "Diomedeidae",
            "Genus": "Phoebastria",
            "Species": "P. immutabilis",
            "pOne": "The Laysan albatross (Phoebastria immutabilis) is a large seabird that ranges across the North Pacific. The Northwestern Hawaiian Islands are home to 99.7% of the population. This small (for its family) gull-like albatross is the second-most common seabird in the Hawaiian Islands, with an estimated population of 1.18 million birds, and is currently expanding (or possibly re-expanding) its range to new islands. The Laysan albatross was first described as Diomedea immutabilis by Lionel Walter Rothschild, in 1893, on the basis of a specimen from Laysan Island.",
            "pTwo": "The Laysan albatross averages 81 cm (32 in) in length[4] and has a wingspan of 195 to 203 cm (77–80 in). Males, which weigh 2.4 to 4.1 kg (5.3–9.0 lb), are larger than females, which weigh 1.9 to 3.6 kg (4.2–7.9 lb). This albatross has blackish-gray upperwing, mantle, back, upper rump, and tail, and its head, lower rump, and underparts are white. It has a black smudge around the eye, and its underwing pattern varies between individuals, with some having narrower black margins and variable amounts of black in the underwing coverts. Finally, the bill is pink with a dark tip. Juveniles have a gray bill and a dark upper rump. This species does not have a breeding plumage."
        },
        {
            "id": 6,
            "class": "cards",
            "classConten": "cards-content",
            "classText": "cards-text",
            "cardId": "penguin",
            "title": "Magellanic penguin",
            "img": "../Assets/birds/Magellan_penguin.JPG",
            "Kingdom": "Animalia",
            "Phylum": "Chordata",
            "Class": "Aves",
            "Clade": "Strisores",
            "Order": "Sphenisciformes",
            "Family": "Spheniscidae",
            "Genus": "Spheniscus",
            "Species": "S. magellanicus",
            "pOne": "The Magellanic penguin (Spheniscus magellanicus) is a South American penguin, breeding in coastal Patagonia, including Argentina, Chile, and the Falkland Islands, with some migrating to Brazil and Uruguay, where they are occasionally seen as far north as Espirito Santo. Vagrants have been found in El Salvador, the Avian Island in Antarctica, Australia, and New Zealand.[1] It is the most numerous of the Spheniscus banded penguins. Its nearest relatives are the African penguin, the Humboldt penguin, and the Galápagos penguins. The Magellanic penguin was named after Portuguese explorer Ferdinand Magellan, who spotted the birds in 1520.[2] The species is listed as being of Least Concern by the IUCN.",
            "pTwo": "Adults have black backs and white abdomens. There are two black bands between the head and the breast, with the lower band shaped in an inverted horseshoe. The head is black with a broad white border that runs from behind the eye, around the black ear-coverts and chin, and joins at the throat. Chicks and younger penguins have grey-blue backs, with a more faded grey-blue colour on their chest. Magellanic penguins can live up to 25 years in the wild, but as much as 30 years in captivity. Captain Eo, a male Magellanic penguin at the San Francisco Zoo, died in 2022 at the age of 40."
        },
        {
            "id": 7,
            "class": "cards",
            "classConten": "cards-content",
            "classText": "cards-text",
            "cardId": "eagle",
            "title": "Golden eagle",
            "img": "../Assets/birds/GoldenEagle.jpg",
            "Kingdom": "Animalia",
            "Phylum": "Chordata",
            "Class": "Aves",
            "Clade": "Strisores",
            "Order": "Accipitriformes",
            "Family": "Accipitridae",
            "Genus": "Aquila",
            "Species": "A. chrysaetos",
            "pOne": "The golden eagle (Aquila chrysaetos) is a bird of prey living in the Northern Hemisphere. It is the most widely distributed species of eagle. Like all eagles, it belongs to the family Accipitridae. They are one of the best-known birds of prey in the Northern Hemisphere. These birds are dark brown, with lighter golden-brown plumage on their napes. Immature eagles of this species typically have white on the tail and often have white markings on the wings. Golden eagles use their agility and speed combined with powerful feet and large, sharp talons to hunt a variety of prey, mainly hares, rabbits, and marmots and other ground squirrels.[4] Golden eagles maintain home ranges or territories that may be as large as 200 km2 (77 sq mi). They build large nests in cliffs and other high places to which they may return for several breeding years. Most breeding activities take place in the spring; they are monogamous and may remain together for several years or possibly for life. Females lay up to four eggs, and then incubate them for six weeks. Typically, one or two young survive to fledge in about three months. These juvenile golden eagles usually attain full independence in the fall, after which they wander widely until establishing a territory for themselves in four to five years.",
            "pTwo": "The standard measurements of the species include a wing chord length of 52–72 cm (20–28 in), a tail length of 26.5–38 cm (10.4–15.0 in) and a tarsus length of 9.4–12.2 cm (3.7–4.8 in).[15] The culmen (upper ridge of beak) reportedly averages around 4.5 cm (1.8 in), with a range of 3.6 to 5 cm (1.4 to 2.0 in). The bill length from the gape measures around 6 cm (2.4 in).[39][40] The long, straight and powerful hallux-claw (hind claw) can range from 4.5 to 6.34 cm (1.77 to 2.50 in), about one centimetre longer than in a bald eagle and a little more than one centimetre less than a harpy eagle."
        },
        {
            "id": 8,
            "class": "cards",
            "classConten": "cards-content",
            "classText": "cards-text",
            "cardId": "wild-turkey",
            "title": "Wild turkey",
            "img": "../Assets/birds/wild_turkey.jpg",
            "Kingdom": "Animalia",
            "Phylum": "Chordata",
            "Class": "Aves",
            "Clade": "Strisores",
            "Order": "Galliformes",
            "Family": "Phasianidae",
            "Genus": "Meleagris",
            "Species": "M. gallopavo",
            "pOne": "The wild turkey (Meleagris gallopavo) is an upland ground bird native to North America, one of two extant species of turkey and the heaviest member of the order Galliformes. It is the ancestor to the domestic turkey, which was originally derived from a southern Mexican subspecies of wild turkey (not the related ocellated turkey).",
            "pTwo": " Adult wild turkeys have long reddish-yellow to grayish-green legs. The body feathers are generally blackish and dark, sometimes grey brown overall with a coppery sheen that becomes more complex in adult males. Adult males, called toms or gobblers, have a large, featherless, reddish head, red throat, and red wattles on the throat and neck. The head has fleshy growths called caruncles. Juvenile males are called jakes; the difference between an adult male and a juvenile is that the jake has a very short beard and his tail fan has longer feathers in the middle. The adult male's tail fan feathers will be all the same length.[2] When males are excited, a fleshy flap on the bill (called a snood) expands, and this, the wattles and the bare skin of the head and neck all become engorged with blood. Each foot has three toes in front, with a shorter, rear-facing toe in back; males have a spur behind each of their lower legs."
        }
    ],
    "cats":[
        {
            "id": 1,
            "class": "cards",
            "classConten": "cards-content",
            "classText": "cards-text",
            "cardId": "aegean",
            "title": "Aegean Island Cat",
            "img": "../Assets/cats/Aegean_Island_Cat.jpg",
            "Breed": "Aegean",
            "LocationOfOrigin": "Greece",
            "Type": "Natural",
            "BodyType": "Moderate",
            "CoatTypeAndLength": "Semi-long",
            "CoatPattern": "Multi-color",
            "pOne": "Aegean cats (Greek: γάτα του Αιγαίου gáta tou Aigaíou) are a naturally occurring landrace of domestic cat originating from the Cycladic Islands of Greece and western Turkey. It is considered a natural cat, developing without human interference. Development of the Aegean cat as a formal breed began in the early 1990s by breeders in the fledgling Greek cat fancy, but the variety has yet to be recognized by any major fancier and breeder organization. It is considered to be the only native Greek variety of cat.",
            "pTwo": "Aegean cats are a medium-sized, muscular, semi-longhaired cat.[dubious – discuss] The coat is bicolour or tricolour with one of the colours being almost always white. White usually takes up between 1/4 to 9/10 of the body. The colour of their coat might include many other colours and patterns. Their paws are medium in size and have a round shape. Their tail can be long and 'hooked'. The ears have a wide base and rounded tips and are covered by hair. The eyes have an almond shape and their color can be any shade of green, blue and yellow. Aegean cats are noted for their affinity for water and fishing. Because the breed was allowed to develop through natural selection, rather than selective breeding, Aegean cats are free from most feline genetic diseases."
        },
        {
            "id": 2,
            "class": "cards",
            "classConten": "cards-content",
            "classText": "cards-text",
            "cardId": "American-Bobtail",
            "title": "American Bobtail",
            "img": "../Assets/cats/American_bobtail.jpg",
            "Breed": "American Bobtail",
            "LocationOfOrigin": "the United States",
            "Type": "Mutation",
            "BodyType": "Cobby",
            "CoatTypeAndLength": "Semi-long",
            "CoatPattern": "All",
            "pOne": "The American Bobtail is an uncommon breed of domestic cat which was developed in the late 1960s. It is most notable for its stubby 'bobbed' tail about one-third to one-half the length of a normal cat's tail. This is the result of a cat body type genetic mutation affecting the tail development, similar to that of a Manx cat. The breed is not related to the Japanese Bobtail despite the similar name and physical type—the breeding programs are entirely unrelated, and the genetic mutation causing the bobbed tail are known to be different because the mutation causing the American Bobtail's tail is dominant, whereas the Japanese Bobtail tail mutation is recessive.",
            "pTwo": "Urban legend says that Bobtails are the result of a cross breeding between a domestic tabby cat and a wild bobcat. The unusual tail is actually the result of a random spontaneous genetic mutation within the domestic cat population, and may be related to the Manx gene, which is also dominant. Yodie, a short-tailed brown tabby male, was mated with a seal-point Siamese female to create the American Bobtail's original bloodline. Most of the early bloodlines have died out. This cat's original appearance genetics were modified in the breed to form a new and improved strain which comes in essentially all colors and coat types. The breed was first recognized by The International Cat Association (TICA, US-based), in 1989. The breed has been accepted for championship competition by TICA, the Cat Fanciers' Association (CFA, also US-based) and the American Cat Fanciers Association (ACFA)."
        }
    ],
    "dogs":[
        {
            "id": 1,
            "class": "cards",
            "classConten": "cards-content",
            "classText": "cards-text",
            "cardId": "",
            "title": "",
            "img": "../Assets/cats/Aegean_Island_Cat.jpg",
            "Breed": "",
            "LocationOfOrigin": "",
            "Type": "",
            "BodyType": "",
            "CoatTypeAndLength": "",
            "CoatPattern": "",
            "pOne": "",
            "pTwo": ""
        }
    ],
    "repitels":[]
}